Constructs a new copy of the input DimensionEqualityLabelFormatting object.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public DimensionEqualityLabelFormatting(
	int leadingSpaces,
	string prefix,
	LabelType labelType,
	string suffix,
	FormatOptions formatOptions
)
  Visual Basic
Public Sub New ( _
	leadingSpaces As Integer, _
	prefix As String, _
	labelType As LabelType, _
	suffix As String, _
	formatOptions As FormatOptions _
)
  Visual C++
public:
DimensionEqualityLabelFormatting(
	int leadingSpaces,
	String^ prefix,
	LabelType labelType,
	String^ suffix,
	FormatOptions^ formatOptions
)
 Parameters
  leadingSpaces
 Type:  System Int32
  prefix
 Type:  System String
  labelType
 Type:  Autodesk.Revit.DB LabelType
  suffix
 Type:  System String
  formatOptions
 Type:  Autodesk.Revit.DB FormatOptions
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   A value passed for an enumeration argument is not a member of that enumeration
 See Also
  DimensionEqualityLabelFormatting Class
  Autodesk.Revit.DB Namespace